"""
Условие Напишите программу, которая принимает из консоли 4 слова и выводит их в формате "первое_второе третье четвертое"

Условие для входных данных: четыре слова, каждое с новой строки;

Требования:

Разрешено использовать только инструкци консольного ввода и вывода.
Следуйте Python Zen: код должен быть минималистичным, лаконичным, но хорошо читаемым.
"""
# Моё решение

first = input()
second = input()
third = input()
fourth = input()
print(f'{first}_{second} {third } {fourth}')