"""
Задача 15
Напишите программу, которая принимает два списка и выводит все элементы первого, которых нет во втором.
"""
set_1 = {'Blue, Red, White, Pink'}
set_2 = {'Black, Green'}
print(set_1 - set_2)

